{
  "title": "Mastering the Shift",
  "subtitle": "Collaborating with Teams of AI Coding Agents",
  "author": "Derek Ashmore",
  "filename": "mastering-the-shift.html",
  "cover_image": "images/Ashmore-Mastering-the-Shift-cover.jpg",
  "description": "Stop watching colleagues outpace you with AI-powered workflows while you cling to outdated methods. They're not smarter—they're simply using tools like GitHub Copilot, ChatGPT, and Claude to solve bigger problems and move ahead. The truth is, developers who resist AI are falling behind. This book strips away the hype, jargon, and fleeting tool-specific tutorials to teach the timeless principles that let you collaborate effectively with AI coding agents, preserving your craftsmanship while gaining the speed and capability modern development demands. The choice is simple: adapt now and accelerate your career, or stagnate while others pass you by.",
  "extended_description": "Stop watching other developers deliver features faster while you struggle with the same old workflows. If you've noticed colleagues completing tasks in hours that take you days, they're not necessarily smarter—they've learned to work effectively with AI coding tools. While you're still debating whether AI assistance is \"real programming,\" they're leveraging GitHub Copilot, ChatGPT, and Claude to solve bigger problems and advance their careers. The uncomfortable truth: Developers who refuse to adapt to AI tools are falling behind. This book cuts through the complexity and academic theory that plague most AI resources. Instead of overwhelming you with sophisticated frameworks and prompt engineering jargon, you'll learn the straightforward principles that actually work in real development environments. This isn't about becoming dependent on AI—it's about becoming more capable with it than you ever were without it. You'll preserve the craftsmanship and problem-solving skills that make programming rewarding while gaining the productivity advantages that modern development demands.",
  "status": "Coming Soon!",
  "purchase_links": {
    "amazon": "https://amazon.com/tbd"
  }
}